# -*- coding: UTF-8 -*-
# description: 路边有一排树，共N棵，每棵树上正好有一只知了，刚开始所有的知了都在睡觉。
#              从早上8点开始，第一棵树上的知了被你吵醒开始鸣叫，一秒后第二棵树上的知了听到了同类的声音被叫醒，也开始鸣叫，
#              再过一秒后第三棵树上的知了听到了第二棵树上知了的声音被叫醒，也开始鸣叫⋯⋯
#              每一棵树上的声音传到相邻树上的时间为1秒，且只会传到相邻的树上（其他树距离太远，声音传不过去）
#              每只知了在鸣叫8秒后会休息8秒，然后继续鸣叫8秒休息8秒⋯⋯
#              请问在第k秒内，第m棵树上的知了是否在鸣叫，是输出1,否输出0 （第一支知了开始鸣叫的时刻为第一秒开始）
#
# example: input:10,2,2    (输入一行数据包含N，k，m，三个数中间用逗号隔开,1<=N<=10000,1<=k<=40000,1<=m<=N)
#          output:1        (1或者0，1表示第k秒内第m棵树上的知了在鸣叫，0则相反)


"""
@param string line 为单行测试数据
@return string 处理后的结果
"""

def solution(line):
    N, k, m = line.split(",")
    N = int(N)
    k = int(k)
    m = int(m)

    if k < m:
        return 0
    else:
        tmp = (k - m) % 16
        return 1 if tmp < 8 else 0


test = "10,2,2"
print(solution(test))
