# -*- coding: UTF-8 -*-
# description: 很久以前，有一个很古老而且很富有的民族，但是有一天，他们惨遭外敌入侵，族人都惨遭杀害无一幸免。族长在最后时刻，
#              为了防止财宝落入贼人之手，把财宝藏在了一个秘密的地方，并设置了一些机关，必须解开所有机关才能够获得宝藏。
#              假设族长一共设置 n 道机关，分别用0 ~ n-1表示。这些机关中有的可以直接解开，
#              有的机关必须要先解开另一个或另一些机关之后才能解开该机关。
#              有一天你机缘巧合来到了这个地方，请问你能否顺利解开所有机关拿到宝藏？
#         举例：假设有两个机关：0和1。 如果要求解开1之前先解开0，而对0没有先决条件要求，则可以先解开0，再解开1，从而获得宝藏；
#              如果要求解开1之前先解开0，同时解开0之前先解开1，则由于0与1互为先决条件，所以无法解开0与1，因此无法获得宝藏。
#     输入格式：单组输入，每组包含k行（0<k<1000)：
#                 第 1 行：一个正整数n，表示一共设置了多少机关，0<n<100;
#                 第 2~k 行：每行由两个整数构成，分别为a和b，表示要解开a机关必须先解开b机关，a与b的范围：0≤a,b≤n−1
#                 第三组为一个使用空格分隔的数组，表示每块石头的对应的价值。
#     输出格式：输出字符串类型的 "true" 或者 "false"，均为小写，表示是否能够解开所有机关拿到宝藏。
#
# example: input:2
#                0 1
#                1 0
#          output:'false'


"""
@param string line 为单行测试数据
@return string 处理后的结果
"""


def solution(line):

    pass


test1="2\n0 1\n1 0"
print(solution(test1))  # "false"